Repository: Minapak/SwiftQuantum
Catalog: Sources/SwiftQuantum/Resources/*.lproj/Localizable.strings
Languages: de, ja, ko, zh_hans

# swiftquantum.tagline
source: The first iOS quantum computing framework with real QPU connectivity
de: Das erste iOS-Framework für Quantencomputing mit echter QPU-Konnektivität
ja: 実際のQPU接続を備えた初のiOS量子コンピューティングフレームワーク
ko: 실제 양자 프로세서 연결을 지원하는 최초의 iOS 양자 컴퓨팅 프레임워크
zh_hans: 首个具备真实QPU连接的iOS量子计算框架

# marketing.headline
source: This is not a toy. This is an iOS-native quantum engine.
de: Das ist kein Spielzeug. Das ist eine iOS-native Quanten-Engine.
ja: これはおもちゃではありません。iOSネイティブ量子エンジンです。
ko: 이것은 장난감이 아닙니다. iOS 네이티브 양자 엔진입니다.
zh_hans: 这不是玩具。这是iOS原生量子引擎。

# marketing.subheadline
source: High-Performance Linear Algebra Kernel for Quantum Simulation on iOS
de: Hochleistungs-Linearalgebra-Kernel für Quantensimulation auf iOS
ja: iOSでの量子シミュレーション用高性能線形代数カーネル
ko: iOS 양자 시뮬레이션을 위한 고성능 선형대수 커널
zh_hans: iOS量子模拟的高性能线性代数内核

# marketing.catchphrase
source: Build the Universe in your Pocket.
de: Baue das Universum in deiner Tasche.
ja: 宇宙をポケットに。
ko: 우주를 주머니에 담으세요.
zh_hans: 将宇宙装入口袋。

# authority.harvard_mit
source: Based on Harvard-MIT 2025 Nature Publications
de: Basierend auf Harvard-MIT 2025 Nature-Publikationen
ja: ハーバード・MIT 2025 Nature論文に基づく
ko: 하버드-MIT 2025 Nature 논문 기반
zh_hans: 基于哈佛-麻省理工2025年Nature论文

# authority.fault_tolerant
source: 448-qubit fault-tolerant architecture with sub-0.5% error rates
de: 448-Qubit fehlertolerante Architektur mit unter 0,5% Fehlerrate
ja: 448量子ビット耐障害アーキテクチャ、0.5%未満のエラー率
ko: 448 큐비트 결함 허용 아키텍처, 0.5% 미만 오류율
zh_hans: 448量子比特容错架构，低于0.5%错误率

# authority.continuous_operation
source: 3,000+ continuous qubit operation demonstrated for 2+ hours
de: Über 3.000 Qubits im kontinuierlichen Betrieb für mehr als 2 Stunden demonstriert
ja: 3,000以上の量子ビットを2時間以上連続運用
ko: 3,000개 이상의 큐비트를 2시간 이상 연속 운용
zh_hans: 3,000+量子比特连续运行超过2小时

# authority.real_hardware
source: Connect to IBM Quantum's 127-qubit systems via QuantumBridge API
de: Verbindung zu IBM Quantums 127-Qubit-Systemen über QuantumBridge API
ja: QuantumBridge APIを介してIBM Quantum 127量子ビットシステムに接続
ko: QuantumBridge API를 통해 IBM Quantum 127큐비트 시스템 연결
zh_hans: 通过QuantumBridge API连接IBM Quantum 127量子比特系统

# tech.simd_optimized
source: SIMD-optimized using Apple Accelerate framework
de: SIMD-optimiert mit Apple Accelerate Framework
ja: Apple Accelerateフレームワークを使用したSIMD最適化
ko: Apple Accelerate 프레임워크로 SIMD 최적화
zh_hans: 使用Apple Accelerate框架进行SIMD优化

# tech.apple_silicon
source: Native Apple Silicon (M-series) acceleration
de: Native Apple Silicon (M-Serie) Beschleunigung
ja: ネイティブApple Silicon (Mシリーズ) アクセラレーション
ko: 네이티브 Apple Silicon (M시리즈) 가속
zh_hans: 原生Apple Silicon（M系列）加速

# tech.performance
source: 400% faster than Python NumPy for matrix operations
de: 400% schneller als Python NumPy bei Matrixoperationen
ja: 行列演算でPython NumPyより400%高速
ko: Python NumPy 대비 행렬 연산 400% 빠름
zh_hans: 矩阵运算比Python NumPy快400%

# tech.qubits_supported
source: Up to 20 qubits local simulation
de: Bis zu 20 Qubits lokale Simulation
ja: ローカルシミュレーション最大20量子ビット
ko: 로컬 시뮬레이션 최대 20큐비트 지원
zh_hans: 本地模拟支持最多20个量子比特

# tech.gates_available
source: 15+ quantum gates including multi-qubit operations
de: Über 15 Quantengatter einschließlich Multi-Qubit-Operationen
ja: マルチ量子ビット演算を含む15以上の量子ゲート
ko: 멀티큐비트 연산 포함 15개 이상의 양자 게이트
zh_hans: 15+量子门，包括多量子比特操作

# push.decoherence_warning
source: ⚠️ Warning: Your qubits are decohering! Return within 3 hours to maintain coherence.
de: ⚠️ Warnung: Ihre Qubits dekohärieren! Kehren Sie innerhalb von 3 Stunden zurück, um die Kohärenz zu erhalten.
ja: ⚠️ 警告: あなたの量子ビットがデコヒーレンスを起こしています！3時間以内にアクセスしてコヒーレンスを維持してください。
ko: ⚠️ 경고: 당신의 큐비트가 붕괴되고 있습니다! 3시간 안에 접속하여 결맞음을 유지하세요.
zh_hans: ⚠️ 警告：您的量子比特正在退相干！请在3小时内返回以维持相干性。

# push.quantum_intuition_decay
source: Your quantum intuition has decreased by 5%. Stimulate your brain plasticity now.
de: Ihre Quantenintuition ist um 5% gesunken. Stimulieren Sie jetzt Ihre Gehirnplastizität.
ja: あなたの量子直感力が5%低下しました。今すぐ戻って脳の可塑性を刺激しましょう。
ko: 당신의 양자 직관력이 5% 감소했습니다. 뇌 가소성을 자극하려면 지금 복귀하세요.
zh_hans: 您的量子直觉下降了5%。立即返回刺激大脑可塑性。

# push.superposition_collapse
source: Your superposition states are collapsing. Return to stabilize your quantum advantage.
de: Ihre Superpositionszustände kollabieren. Kehren Sie zurück, um Ihren Quantenvorteil zu stabilisieren.
ja: あなたの重ね合わせ状態が崩壊しています。量子優位性を安定させるために戻ってください。
ko: 당신의 중첩 상태가 붕괴되고 있습니다. 양자 우위를 안정화하려면 복귀하세요.
zh_hans: 您的叠加态正在坍缩。返回以稳定您的量子优势。

# push.entanglement_fading
source: The entanglement you built is fading. Don't let your progress disappear.
de: Die von Ihnen aufgebaute Verschränkung verblasst. Lassen Sie Ihren Fortschritt nicht verschwinden.
ja: 構築したエンタングルメントが消えています。進捗を失わないでください。
ko: 구축한 얽힘이 사라지고 있습니다. 진행 상황이 사라지게 두지 마세요.
zh_hans: 您建立的纠缠正在消失。不要让您的进度消失。

# push.bell_pair_alert
source: Your Bell pair coherence is dropping. Reconnect to preserve quantum correlations.
de: Die Kohärenz Ihres Bell-Paars sinkt. Verbinden Sie sich erneut, um Quantenkorrelationen zu erhalten.
ja: ベルペアのコヒーレンスが低下しています。量子相関を保存するために再接続してください。
ko: 벨 쌍 결맞음이 떨어지고 있습니다. 양자 상관관계를 보존하려면 다시 연결하세요.
zh_hans: 您的贝尔对相干性正在下降。重新连接以保持量子关联。

# loading.harvard_sync
source: Synchronizing with Harvard research servers... You are performing computations in the top 0.01%.
de: Synchronisierung mit Harvard-Forschungsservern... Sie führen Berechnungen in den oberen 0,01% durch.
ja: ハーバード研究サーバーと同期中... あなたは今、上位0.01%の演算を実行しています。
ko: 하버드 연구소 서버와 동기화 중... 당신은 지금 상위 0.01%의 연산을 수행하고 있습니다.
zh_hans: 正在与哈佛研究服务器同步...您正在执行前0.01%的运算。

# loading.neutral_atom
source: Optimizing neutral atom array... This process is rewiring your logical thinking circuits.
de: Optimierung des neutralen Atom-Arrays... Dieser Prozess verdrahtet Ihre logischen Denkkreise neu.
ja: 中性原子配列を最適化中... このプロセスはあなたの論理的思考回路を再構成します。
ko: 중성 원자 배열 최적화 중... 이 과정은 당신의 논리적 사고 회로를 재구성합니다.
zh_hans: 正在优化中性原子阵列...此过程正在重新配置您的逻辑思维回路。

# loading.surface_code
source: Applying surface code error correction... Based on Nature 2025 fault-tolerant protocols.
de: Anwendung der Surface-Code-Fehlerkorrektur... Basierend auf Nature 2025 fehlertoleranten Protokollen.
ja: 表面符号エラー訂正を適用中... Nature 2025耐障害プロトコルに基づく。
ko: 표면 코드 오류 정정 적용 중... Nature 2025 결함 허용 프로토콜 기반.
zh_hans: 正在应用表面码纠错...基于Nature 2025容错协议。

# loading.magic_state
source: Distilling magic states... Preparing T-gates for universal quantum computation.
de: Destillation von Magic States... Vorbereitung von T-Gattern für universelle Quantenberechnung.
ja: マジックステート蒸留中... 普遍的量子計算のためのTゲートを準備。
ko: 마법 상태 증류 중... 범용 양자 계산을 위한 T 게이트 준비.
zh_hans: 正在蒸馏魔态...为通用量子计算准备T门。

# loading.bloch_sphere
source: Calculating Bloch sphere coordinates... Visualizing your quantum state in 3D.
de: Berechnung der Bloch-Kugel-Koordinaten... Visualisierung Ihres Quantenzustands in 3D.
ja: ブロッホ球座標を計算中... 量子状態を3Dで可視化。
ko: 블로흐 구면 좌표 계산 중... 양자 상태를 3D로 시각화.
zh_hans: 正在计算布洛赫球坐标...在3D中可视化您的量子态。

# loading.tensor_product
source: Computing tensor products... Entangling qubits across Hilbert space dimensions.
de: Berechnung von Tensorprodukten... Verschränkung von Qubits über Hilbert-Raum-Dimensionen.
ja: テンソル積を計算中... ヒルベルト空間次元で量子ビットをエンタングル。
ko: 텐서 곱 계산 중... 힐베르트 공간 차원에서 큐비트 얽힘.
zh_hans: 正在计算张量积...在希尔伯特空间维度中纠缠量子比特。

# loading.eigenvalue
source: Finding eigenvalues... Extracting quantum observables from Hermitian operators.
de: Suche nach Eigenwerten... Extraktion von Quantenobservablen aus hermiteschen Operatoren.
ja: 固有値を探索中... エルミート演算子から量子観測量を抽出。
ko: 고유값 탐색 중... 에르미트 연산자에서 양자 관측량 추출.
zh_hans: 正在寻找特征值...从厄米算符中提取量子可观测量。

# loading.unitary
source: Verifying unitary constraints... Ensuring reversible quantum evolution.
de: Überprüfung unitärer Einschränkungen... Sicherstellung reversibler Quantenentwicklung.
ja: ユニタリ制約を検証中... 可逆的量子進化を保証。
ko: 유니터리 제약 검증 중... 가역적 양자 진화 보장.
zh_hans: 正在验证幺正约束...确保可逆量子演化。

# loading.fidelity
source: Measuring state fidelity... Comparing your circuit to ideal quantum behavior.
de: Messung der Zustandstreue... Vergleich Ihrer Schaltung mit idealem Quantenverhalten.
ja: 状態忠実度を測定中... 回路を理想的な量子動作と比較。
ko: 상태 충실도 측정 중... 회로를 이상적 양자 동작과 비교.
zh_hans: 正在测量态保真度...将电路与理想量子行为进行比较。

# loading.ibm_quantum
source: Connecting to IBM Quantum Brisbane... 127-qubit superconducting processor online.
de: Verbindung zu IBM Quantum Brisbane... 127-Qubit supraleitender Prozessor online.
ja: IBM Quantum Brisbaneに接続中... 127量子ビット超伝導プロセッサオンライン。
ko: IBM Quantum Brisbane 연결 중... 127큐비트 초전도 프로세서 온라인.
zh_hans: 正在连接IBM Quantum Brisbane...127量子比特超导处理器上线。

# achievement.quantum_architect
source: Quantum Architect Level Achieved
de: Quantenarchitekt-Level erreicht
ja: 量子アーキテクトレベル達成
ko: 양자 설계자 레벨 달성
zh_hans: 达成量子架构师等级

# achievement.congratulations
source: Congratulations. You have just intuitively solved a concept that 99% of the world's population cannot understand. Your brain has evolved.
de: Herzlichen Glückwunsch. Sie haben gerade ein Konzept intuitiv gelöst, das 99% der Weltbevölkerung nicht verstehen kann. Ihr Gehirn hat sich weiterentwickelt.
ja: おめでとうございます。あなたは世界人口の99%が理解できない概念を直感的に解決しました。あなたの脳は進化しました。
ko: 축하합니다. 당신은 방금 전 세계 인구의 99%가 이해하지 못하는 개념을 직관적으로 해결했습니다. 당신의 뇌는 진화했습니다.
zh_hans: 恭喜。您刚刚直观地解决了世界上99%的人无法理解的概念。您的大脑已经进化。

# achievement.entanglement_master
source: Entanglement Master Unlocked
de: Verschränkungsmeister freigeschaltet
ja: エンタングルメントマスター解除
ko: 얽힘 마스터 해제
zh_hans: 解锁纠缠大师

# achievement.entanglement_desc
source: You have successfully created a Bell state. Welcome to the 0.1% who truly understand non-local correlations.
de: Sie haben erfolgreich einen Bell-Zustand erstellt. Willkommen bei den 0,1%, die nicht-lokale Korrelationen wirklich verstehen.
ja: ベル状態の作成に成功しました。非局所相関を真に理解する0.1%へようこそ。
ko: 벨 상태를 성공적으로 생성했습니다. 비국소적 상관관계를 진정으로 이해하는 0.1%에 오신 것을 환영합니다.
zh_hans: 您成功创建了贝尔态。欢迎加入真正理解非局域关联的0.1%。

# achievement.error_corrector
source: Fault-Tolerant Pioneer
de: Fehlertoleranter Pionier
ja: 耐障害パイオニア
ko: 결함 허용 개척자
zh_hans: 容错先驱

# achievement.error_corrector_desc
source: You have simulated surface code error correction. You are now operating at the frontier of quantum computing research.
de: Sie haben Surface-Code-Fehlerkorrektur simuliert. Sie arbeiten jetzt an der Spitze der Quantencomputing-Forschung.
ja: 表面符号エラー訂正をシミュレートしました。量子コンピューティング研究の最前線で作業しています。
ko: 표면 코드 오류 정정을 시뮬레이션했습니다. 이제 양자 컴퓨팅 연구의 최전선에서 작업하고 있습니다.
zh_hans: 您模拟了表面码纠错。您现在正在量子计算研究的前沿工作。

# achievement.grover_champion
source: Grover's Oracle Champion
de: Grovers Orakel-Champion
ja: グローバーオラクルチャンピオン
ko: 그로버 오라클 챔피언
zh_hans: 格罗弗预言冠军

# achievement.grover_desc
source: You achieved quadratic speedup over classical search. The quantum advantage is now yours.
de: Sie haben eine quadratische Beschleunigung gegenüber klassischer Suche erreicht. Der Quantenvorteil gehört nun Ihnen.
ja: 古典検索に対する二次速度向上を達成しました。量子優位性はあなたのものです。
ko: 고전 검색 대비 이차 속도 향상을 달성했습니다. 양자 우위는 이제 당신의 것입니다.
zh_hans: 您实现了相对于经典搜索的二次加速。量子优势现在属于您。

# paywall.headline
source: Access Restricted: Harvard Laboratory Mode
de: Zugang beschränkt: Harvard-Labormodus
ja: アクセス制限: ハーバード研究所モード
ko: 접근 제한: 하버드 연구소 모드
zh_hans: 访问受限：哈佛实验室模式

# paywall.description
source: This feature connects to real physical hardware. It is only permitted for those who are ready to design the real future, not mere curiosity.
de: Diese Funktion verbindet sich mit echter physischer Hardware. Sie ist nur für diejenigen zugelassen, die bereit sind, die echte Zukunft zu gestalten, nicht aus bloßer Neugier.
ja: この機能は実際の物理ハードウェアに接続します。単なる好奇心ではなく、本当の未来を設計する準備ができた方にのみ許可されます。
ko: 이 기능은 실제 물리적 하드웨어와 연결됩니다. 단순한 호기심이 아닌, 진짜 미래를 설계할 준비가 된 분들에게만 허용됩니다.
zh_hans: 此功能连接到真实的物理硬件。仅允许那些准备好设计真正未来的人使用，而非单纯的好奇心。

# paywall.button
source: Prove Your Qualification and Enter
de: Qualifikation nachweisen und eintreten
ja: 資格を証明して入場
ko: 자격 증명하고 입장하기
zh_hans: 证明您的资格并进入

# paywall.price_monthly
source: $29.99/month
de: 29,99 €/Monat
ja: 月額¥4,500
ko: 월 ₩39,900
zh_hans: ¥199/月

# paywall.price_yearly
source: $299.99/year
de: 299,99 €/Jahr
ja: 年額¥45,000
ko: 연 ₩399,000
zh_hans: ¥1999/年

# paywall.free_tier
source: Free Tier
de: Kostenlose Stufe
ja: 無料プラン
ko: 무료 등급
zh_hans: 免费版

# paywall.free_desc
source: Local simulation up to 8 qubits. Basic quantum concepts.
de: Lokale Simulation bis zu 8 Qubits. Grundlegende Quantenkonzepte.
ja: 最大8量子ビットのローカルシミュレーション。基本的な量子概念。
ko: 최대 8큐비트 로컬 시뮬레이션. 기본 양자 개념.
zh_hans: 本地模拟最多8个量子比特。基本量子概念。

# paywall.pro_tier
source: Pro Tier
de: Pro-Stufe
ja: プロプラン
ko: 프로 등급
zh_hans: 专业版

# paywall.pro_desc
source: Up to 64 qubits. Full algorithm library. Error correction simulation.
de: Bis zu 64 Qubits. Vollständige Algorithmen-Bibliothek. Fehlerkorrektur-Simulation.
ja: 最大64量子ビット。完全なアルゴリズムライブラリ。エラー訂正シミュレーション。
ko: 최대 64큐비트. 전체 알고리즘 라이브러리. 오류 정정 시뮬레이션.
zh_hans: 最多64个量子比特。完整算法库。纠错模拟。

# paywall.enterprise_tier
source: Enterprise
ja: エンタープライズ
ko: 엔터프라이즈
zh_hans: 企业版

# paywall.enterprise_desc
source: 256 qubits. Real IBM QPU access. Harvard-MIT research integration.
de: 256 Qubits. Echter IBM QPU-Zugang. Harvard-MIT Forschungsintegration.
ja: 256量子ビット。実際のIBM QPUアクセス。ハーバード・MIT研究統合。
ko: 256큐비트. 실제 IBM QPU 접근. 하버드-MIT 연구 통합.
zh_hans: 256个量子比特。真实IBM QPU访问。哈佛-MIT研究集成。

# state.zero
source: |0⟩ Ground State
de: |0⟩ Grundzustand
ja: |0⟩ 基底状態
ko: |0⟩ 기저 상태
zh_hans: |0⟩ 基态

# state.one
source: |1⟩ Excited State
de: |1⟩ Angeregter Zustand
ja: |1⟩ 励起状態
ko: |1⟩ 여기 상태
zh_hans: |1⟩ 激发态

# state.plus
source: |+⟩ Superposition
ja: |+⟩ 重ね合わせ
ko: |+⟩ 중첩
zh_hans: |+⟩ 叠加

# state.minus
source: |−⟩ Anti-Superposition
ja: |−⟩ 反重ね合わせ
ko: |−⟩ 반중첩
zh_hans: |−⟩ 反叠加

# state.bell
source: Bell State |Φ+⟩
de: Bell-Zustand |Φ+⟩
ja: ベル状態 |Φ+⟩
ko: 벨 상태 |Φ+⟩
zh_hans: 贝尔态 |Φ+⟩

# state.ghz
source: GHZ State
de: GHZ-Zustand
ja: GHZ状態
ko: GHZ 상태
zh_hans: GHZ态

# state.custom
source: Custom Quantum State
de: Benutzerdefinierter Quantenzustand
ja: カスタム量子状態
ko: 사용자 정의 양자 상태
zh_hans: 自定义量子态

# gate.hadamard
source: Hadamard (H)
ja: アダマール (H)
ko: 아다마르 (H)
zh_hans: 阿达马门 (H)

# gate.hadamard_desc
source: Creates equal superposition. The gateway to quantum parallelism.
de: Erzeugt gleiche Superposition. Das Tor zum Quantenparallelismus.
ja: 等しい重ね合わせを作成します。量子並列性への入り口。
ko: 동등한 중첩을 생성합니다. 양자 병렬성의 관문.
zh_hans: 创建等幅叠加。量子并行性的入口。

# gate.pauli_x
source: Pauli-X (NOT)
ja: パウリ-X (NOT)
ko: 파울리-X (NOT)
zh_hans: 泡利-X门 (NOT)

# gate.pauli_x_desc
source: Quantum bit flip. |0⟩ ↔ |1⟩
de: Quanten-Bitflip. |0⟩ ↔ |1⟩
ja: 量子ビット反転。|0⟩ ↔ |1⟩
ko: 양자 비트 반전. |0⟩ ↔ |1⟩
zh_hans: 量子比特翻转。|0⟩ ↔ |1⟩

# gate.pauli_y
source: Pauli-Y
ja: パウリ-Y
ko: 파울리-Y
zh_hans: 泡利-Y门

# gate.pauli_y_desc
source: Rotation with phase. Combines bit and phase flip.
de: Rotation mit Phase. Kombiniert Bit- und Phasenflip.
ja: 位相付き回転。ビットと位相反転の組み合わせ。
ko: 위상이 있는 회전. 비트와 위상 반전 결합.
zh_hans: 带相位的旋转。结合比特和相位翻转。

# gate.pauli_z
source: Pauli-Z
ja: パウリ-Z
ko: 파울리-Z
zh_hans: 泡利-Z门

# gate.pauli_z_desc
source: Phase flip gate. |1⟩ → −|1⟩
de: Phasenflip-Gatter. |1⟩ → −|1⟩
ja: 位相反転ゲート。|1⟩ → −|1⟩
ko: 위상 반전 게이트. |1⟩ → −|1⟩
zh_hans: 相位翻转门。|1⟩ → −|1⟩

# gate.cnot
source: CNOT (Controlled-NOT)
ja: CNOT (制御NOT)
ko: CNOT (제어-NOT)
zh_hans: CNOT（受控NOT）

# gate.cnot_desc
source: Two-qubit entangling gate. The heart of quantum computation.
de: Zwei-Qubit-Verschränkungsgatter. Das Herz der Quantenberechnung.
ja: 2量子ビットエンタングルゲート。量子計算の核心。
ko: 2큐비트 얽힘 게이트. 양자 계산의 핵심.
zh_hans: 双量子比特纠缠门。量子计算的核心。

# gate.toffoli
source: Toffoli (CCNOT)
ja: トフォリ (CCNOT)
ko: 토폴리 (CCNOT)
zh_hans: 托弗利门 (CCNOT)

# gate.toffoli_desc
source: Universal reversible gate. Three-qubit controlled operation.
de: Universelles reversibles Gatter. Drei-Qubit-kontrollierte Operation.
ja: 普遍可逆ゲート。3量子ビット制御演算。
ko: 범용 가역 게이트. 3큐비트 제어 연산.
zh_hans: 通用可逆门。三量子比特受控操作。

# algorithm.bell
source: Bell State Protocol
de: Bell-Zustand-Protokoll
ja: ベル状態プロトコル
ko: 벨 상태 프로토콜
zh_hans: 贝尔态协议

# algorithm.bell_desc
source: Create maximally entangled two-qubit states. Foundation of quantum communication.
de: Erzeugt maximal verschränkte Zwei-Qubit-Zustände. Grundlage der Quantenkommunikation.
ja: 最大エンタングル2量子ビット状態を作成。量子通信の基礎。
ko: 최대로 얽힌 2큐비트 상태 생성. 양자 통신의 기초.
zh_hans: 创建最大纠缠双量子比特态。量子通信的基础。

# algorithm.deutsch_jozsa
source: Deutsch-Jozsa Algorithm
de: Deutsch-Jozsa-Algorithmus
ja: ドイチ・ジョサアルゴリズム
ko: 도이치-조사 알고리즘
zh_hans: Deutsch-Jozsa算法

# algorithm.deutsch_jozsa_desc
source: Exponential speedup for function classification. One query vs 2^n.
de: Exponentielle Beschleunigung für Funktionsklassifikation. Eine Abfrage vs. 2^n.
ja: 関数分類の指数的速度向上。1クエリ vs 2^n。
ko: 함수 분류의 지수적 속도 향상. 1회 쿼리 vs 2^n.
zh_hans: 函数分类的指数级加速。1次查询 vs 2^n。

# algorithm.grover
source: Grover's Search Algorithm
de: Grovers Suchalgorithmus
ja: グローバー検索アルゴリズム
ko: 그로버 검색 알고리즘
zh_hans: 格罗弗搜索算法

# algorithm.grover_desc
source: Quadratic speedup for unstructured search. O(√N) vs O(N).
de: Quadratische Beschleunigung für unstrukturierte Suche. O(√N) vs. O(N).
ja: 非構造化検索の二次速度向上。O(√N) vs O(N)。
ko: 비구조화 검색의 이차 속도 향상. O(√N) vs O(N).
zh_hans: 非结构化搜索的二次加速。O(√N) vs O(N)。

# algorithm.shor
source: Shor's Algorithm
de: Shors Algorithmus
ja: ショアアルゴリズム
ko: 쇼어 알고리즘
zh_hans: 肖尔算法

# algorithm.shor_desc
source: Polynomial-time integer factorization. Breaks RSA cryptography.
de: Polynomielle Primfaktorzerlegung. Bricht RSA-Kryptographie.
ja: 多項式時間整数因数分解。RSA暗号を破る。
ko: 다항 시간 정수 인수분해. RSA 암호화 해독.
zh_hans: 多项式时间整数分解。破解RSA加密。

# algorithm.vqe
source: Variational Quantum Eigensolver
de: Variationeller Quanten-Eigensolver
ja: 変分量子固有値ソルバー
ko: 변분 양자 고유값 해석기
zh_hans: 变分量子本征求解器

# algorithm.vqe_desc
source: Hybrid quantum-classical optimization. Chemistry applications.
de: Hybride quanten-klassische Optimierung. Chemieanwendungen.
ja: ハイブリッド量子古典最適化。化学応用。
ko: 하이브리드 양자-고전 최적화. 화학 응용.
zh_hans: 混合量子-经典优化。化学应用。

# algorithm.qaoa_desc
source: Quantum Approximate Optimization. Combinatorial problem solving.
de: Quantum Approximate Optimization Algorithm. Lösung kombinatorischer Probleme.
ja: 量子近似最適化。組み合わせ問題解決。
ko: 양자 근사 최적화. 조합 문제 해결.
zh_hans: 量子近似优化。组合问题求解。

# error.surface_code
source: Surface Code Error Correction
de: Surface-Code-Fehlerkorrektur
ja: 表面符号エラー訂正
ko: 표면 코드 오류 정정
zh_hans: 表面码纠错

# error.surface_code_desc
source: Topological protection against local errors. Distance-3 encoding.
de: Topologischer Schutz gegen lokale Fehler. Distanz-3-Kodierung.
ja: 局所エラーに対する位相的保護。距離3エンコーディング。
ko: 국소 오류에 대한 위상적 보호. 거리-3 인코딩.
zh_hans: 对局部错误的拓扑保护。距离-3编码。

# error.magic_state
source: Magic State Distillation
de: Magic-State-Destillation
ja: マジックステート蒸留
ko: 마법 상태 증류
zh_hans: 魔态蒸馏

# error.magic_state_desc
source: Purify T-gate resources. 15-to-1 distillation protocol.
de: Reinigung von T-Gatter-Ressourcen. 15-zu-1-Destillationsprotokoll.
ja: Tゲートリソースを精製。15対1蒸留プロトコル。
ko: T 게이트 리소스 정제. 15대1 증류 프로토콜.
zh_hans: 纯化T门资源。15对1蒸馏协议。

# error.fault_tolerant
source: Fault-Tolerant Threshold
de: Fehlertoleranz-Schwelle
ja: 耐障害閾値
ko: 결함 허용 임계값
zh_hans: 容错阈值

# error.fault_tolerant_desc
source: Sub-0.5% error rate achieved. Based on Harvard-MIT 2025 research.
de: Unter 0,5% Fehlerrate erreicht. Basierend auf Harvard-MIT 2025 Forschung.
ja: 0.5%未満のエラー率を達成。ハーバード・MIT 2025研究に基づく。
ko: 0.5% 미만 오류율 달성. 하버드-MIT 2025 연구 기반.
zh_hans: 实现低于0.5%的错误率。基于哈佛-MIT 2025研究。

# executor.local
source: Local Swift Simulator
de: Lokaler Swift-Simulator
ja: ローカルSwiftシミュレーター
ko: 로컬 Swift 시뮬레이터
zh_hans: 本地Swift模拟器

# executor.local_desc
source: Native simulation optimized for Apple Silicon.
de: Native Simulation optimiert für Apple Silicon.
ja: Apple Siliconに最適化されたネイティブシミュレーション。
ko: Apple Silicon에 최적화된 네이티브 시뮬레이션.
zh_hans: 针对Apple Silicon优化的原生模拟。

# executor.ibm_brisbane_desc
source: 127-qubit superconducting processor.
de: 127-Qubit supraleitender Prozessor.
ja: 127量子ビット超伝導プロセッサ。
ko: 127큐비트 초전도 프로세서.
zh_hans: 127量子比特超导处理器。

# executor.ibm_osaka_desc
source: 127-qubit Eagle processor.
de: 127-Qubit Eagle-Prozessor.
ja: 127量子ビットEagleプロセッサ。
ko: 127큐비트 Eagle 프로세서.
zh_hans: 127量子比特Eagle处理器。

# executor.bridge
source: QuantumBridge Cloud
ja: QuantumBridgeクラウド
ko: QuantumBridge 클라우드
zh_hans: QuantumBridge云

# executor.bridge_desc
source: Unified API for multiple quantum backends.
de: Einheitliche API für mehrere Quanten-Backends.
ja: 複数の量子バックエンド用統合API。
ko: 여러 양자 백엔드를 위한 통합 API.
zh_hans: 多量子后端统一API。

# measure.shots
source: Measurement Shots
de: Messungen
ja: 測定ショット数
ko: 측정 횟수
zh_hans: 测量次数

# measure.probability
source: Probability Distribution
de: Wahrscheinlichkeitsverteilung
ja: 確率分布
ko: 확률 분포
zh_hans: 概率分布

# measure.counts
source: Measurement Counts
de: Messzählungen
ja: 測定カウント
ko: 측정 카운트
zh_hans: 测量计数

# measure.fidelity
source: State Fidelity
de: Zustandstreue
ja: 状態忠実度
ko: 상태 충실도
zh_hans: 态保真度

# measure.entropy
source: Von Neumann Entropy
de: Von-Neumann-Entropie
ja: フォン・ノイマンエントロピー
ko: 폰 노이만 엔트로피
zh_hans: 冯诺依曼熵

# ui.run
source: Run Circuit
de: Schaltung ausführen
ja: 回路実行
ko: 회로 실행
zh_hans: 运行电路

# ui.simulate
source: Simulate
de: Simulieren
ja: シミュレート
ko: 시뮬레이션
zh_hans: 模拟

# ui.measure
source: Measure
de: Messen
ja: 測定
ko: 측정
zh_hans: 测量

# ui.reset
source: Reset
de: Zurücksetzen
ja: リセット
ko: 초기화
zh_hans: 重置

# ui.export
source: Export QASM
de: QASM exportieren
ja: QASMエクスポート
ko: QASM 내보내기
zh_hans: 导出QASM

# ui.settings
source: Settings
de: Einstellungen
ja: 設定
ko: 설정
zh_hans: 设置

# ui.help
source: Help
de: Hilfe
ja: ヘルプ
ko: 도움말
zh_hans: 帮助

# ui.about
source: About
de: Über
ja: 情報
ko: 정보
zh_hans: 关于

# academy.title
source: Quantum Academy
de: Quantenakademie
ja: 量子アカデミー
ko: 양자 아카데미
zh_hans: 量子学院

# academy.subtitle
source: MIT/Harvard Research-Based Curriculum
de: MIT/Harvard forschungsbasierter Lehrplan
ja: MIT/ハーバード研究ベースカリキュラム
ko: MIT/하버드 연구 기반 커리큘럼
zh_hans: MIT/哈佛研究课程

# academy.track.fundamentals
source: Fundamentals Track
de: Grundlagen-Track
ja: 基礎トラック
ko: 기초 트랙
zh_hans: 基础课程

# academy.track.algorithms
source: Algorithms Track
de: Algorithmen-Track
ja: アルゴリズムトラック
ko: 알고리즘 트랙
zh_hans: 算法课程

# academy.track.hardware
source: Hardware Track
ja: ハードウェアトラック
ko: 하드웨어 트랙
zh_hans: 硬件课程

# academy.track.security
source: Security Track
de: Sicherheits-Track
ja: セキュリティトラック
ko: 보안 트랙
zh_hans: 安全课程

# academy.lesson.complete
source: Lesson Complete
de: Lektion abgeschlossen
ja: レッスン完了
ko: 레슨 완료
zh_hans: 课程完成

# academy.streak
source: Day Streak
de: Tagessträhne
ja: 連続日数
ko: 연속 학습 일수
zh_hans: 连续天数

# academy.xp
source: XP Earned
de: Verdiente XP
ja: 獲得XP
ko: 획득 XP
zh_hans: 获得XP

# academy.badge
source: Badge Unlocked
de: Abzeichen freigeschaltet
ja: バッジ解除
ko: 배지 해제
zh_hans: 徽章解锁

# industry.title
source: Industry Solutions
de: Enterprise Quantenlösungen
ja: 産業ソリューション
ko: 엔터프라이즈 양자 솔루션
zh_hans: 行业解决方案

# industry.subtitle
source: Quantum-powered business optimization
ja: 量子ベースのビジネス最適化
zh_hans: 量子驱动的业务优化

# industry.finance
source: Financial Optimization
de: Finanzoptimierung
ja: 金融最適化
ko: 금융 최적화
zh_hans: 金融优化

# industry.finance_desc
source: Portfolio optimization with 100x speedup potential.
de: Portfoliooptimierung mit 100-facher Beschleunigungspotential.
ja: 100倍速度向上可能なポートフォリオ最適化。
ko: 100배 속도 향상 가능한 포트폴리오 최적화.
zh_hans: 投资组合优化，潜在100倍加速。

# industry.healthcare
source: Drug Discovery
de: Medikamentenentdeckung
ja: 創薬
ko: 신약 개발
zh_hans: 药物发现

# industry.healthcare_desc
source: Molecular simulation for pharmaceutical research.
de: Molekularsimulation für pharmazeutische Forschung.
ja: 製薬研究のための分子シミュレーション。
ko: 제약 연구를 위한 분자 시뮬레이션.
zh_hans: 制药研究的分子模拟。

# industry.logistics
source: Supply Chain
de: Lieferkette
ja: サプライチェーン
ko: 공급망
zh_hans: 供应链

# industry.logistics_desc
source: Route optimization using quantum annealing.
de: Routenoptimierung mit Quanten-Annealing.
ja: 量子アニーリングを使用したルート最適化。
ko: 양자 어닐링을 활용한 경로 최적화.
zh_hans: 使用量子退火的路径优化。

# industry.security
source: Post-Quantum Cryptography
de: Post-Quanten-Kryptographie
ja: ポスト量子暗号
ko: 포스트 양자 암호화
zh_hans: 后量子密码学

# industry.security_desc
source: Quantum-resistant encryption algorithms.
de: Quantenresistente Verschlüsselungsalgorithmen.
ja: 量子耐性暗号アルゴリズム。
ko: 양자 내성 암호화 알고리즘.
zh_hans: 抗量子加密算法。

# industry.roi.title
source: ROI Calculator
ja: ROI計算機
zh_hans: ROI计算器

# industry.roi.subtitle
source: See your potential savings
ja: 予想節約額を確認
zh_hans: 查看预估节省

# industry.roi.calculate
source: Calculate Your ROI
ja: ROIを計算する
zh_hans: 计算您的ROI
