Repository: Minapak/SwiftQuantum
Catalog: Sources/SwiftQuantum/Resources/*.lproj/Localizable.strings
Languages: de, ja, ko, zh_hans

# industry.roi.estimate
source: Estimate your quantum advantage
ja: 量子コンピューティングの利点を推定
zh_hans: 估算量子优势

# industry.roi.team_size
source: Team Size
ja: チーム規模
zh_hans: 团队规模

# industry.roi.budget
source: Annual IT Budget
ja: 年間ITバジェット
zh_hans: 年度IT预算

# industry.roi.calculate_btn
source: Calculate ROI
ja: ROI計算
zh_hans: 计算ROI

# industry.roi.estimated_savings
source: Estimated Annual Savings
ja: 予想年間節約額
zh_hans: 预估年度节省

# industry.roi.payback
source: Payback
ja: 投資回収
zh_hans: 回收期

# industry.roi.projected
source: Projected Annual Gain
ja: 予想年間利益
zh_hans: 预计年度收益

# industry.roi.calculate_data
source: Calculate for your data
ja: データで計算する
zh_hans: 根据您的数据计算

# industry.roi.progress
source: Based on your Level 8 progress
ja: レベル8の進行状況に基づく
zh_hans: 基于您的8级进度

# industry.trial
source: Start with a 7-day free trial
ja: 7日間の無料トライアルで開始
zh_hans: 开始7天免费试用

# industry.use_cases
source: Key Use Cases
ja: 主な活用事例
zh_hans: 主要用例

# industry.learn_more
source: Learn More
ja: 詳細を見る
zh_hans: 了解更多

# industry.get_started
source: Get Started
ja: 始める
zh_hans: 开始使用

# industry.overview
source: Overview
ja: 概要
zh_hans: 概述

# industry.key_benefits
source: Key Benefits
ja: 主なメリット
zh_hans: 主要优势

# industry.quantum_solutions
source: Quantum Solutions
ja: 量子ソリューション
zh_hans: 量子解决方案

# industry.choose_plan
source: Choose Your Plan
ja: プランを選択
zh_hans: 选择计划

# industry.success_stories
source: Success Stories
ja: 成功事例
zh_hans: 成功案例

# industry.pricing_soon
source: Pricing Details Coming Soon
ja: 価格情報準備中
zh_hans: 定价详情即将推出

# industry.premium.title
source: Enterprise Solutions Premium
ja: エンタープライズソリューションプレミアム
zh_hans: 企业解决方案高级版

# industry.premium.desc
source: Unlock all industry solutions and quantum-powered business optimization
ja: すべての産業ソリューションと量子ベースのビジネス最適化をアンロック
zh_hans: 解锁所有行业解决方案和量子驱动的业务优化

# industry.premium.upgrade
source: Upgrade - $9.99/month
ja: アップグレード - $9.99/月
zh_hans: 升级 - $9.99/月

# industry.compare.feature
source: Feature
ja: 機能
zh_hans: 功能

# industry.compare.pro
source: Pro
ja: プロ
zh_hans: 专业版

# industry.compare.enterprise
source: Enterprise
ja: エンタープライズ
zh_hans: 企业版

# industry.learn.ibm
source: IBM Quantum Learning
ja: IBM量子学習
zh_hans: IBM量子学习

# industry.learn.mit
source: MIT xPRO Quantum Course
ja: MIT xPRO量子コース
zh_hans: MIT xPRO量子课程

# industry.learn.roadmap
source: IBM Quantum 2026 Roadmap
ja: IBM量子2026ロードマップ
zh_hans: IBM量子2026路线图

# error.circuit_too_large
source: Circuit exceeds maximum qubit limit
de: Schaltung überschreitet maximales Qubit-Limit
ja: 回路が最大量子ビット制限を超えています
ko: 회로가 최대 큐비트 한도를 초과합니다
zh_hans: 电路超出最大量子比特限制

# error.invalid_gate
source: Invalid gate operation
de: Ungültige Gatteroperation
ja: 無効なゲート演算
ko: 잘못된 게이트 연산
zh_hans: 无效的门操作

# error.not_normalized
source: State is not properly normalized
de: Zustand ist nicht richtig normalisiert
ja: 状態が正しく正規化されていません
ko: 상태가 올바르게 정규화되지 않았습니다
zh_hans: 态未正确归一化

# error.connection_failed
source: Failed to connect to quantum backend
de: Verbindung zum Quanten-Backend fehlgeschlagen
ja: 量子バックエンドへの接続に失敗しました
ko: 양자 백엔드 연결 실패
zh_hans: 无法连接到量子后端

# error.api_key_invalid
source: Invalid API key for remote execution
de: Ungültiger API-Schlüssel für Remote-Ausführung
ja: リモート実行用のAPIキーが無効です
ko: 원격 실행을 위한 API 키가 유효하지 않습니다
zh_hans: 远程执行的API密钥无效

# error.queue_full
source: Execution queue is full. Please try again later.
de: Ausführungswarteschlange ist voll. Bitte versuchen Sie es später erneut.
ja: 実行キューがいっぱいです。後でもう一度お試しください。
ko: 실행 대기열이 가득 찼습니다. 나중에 다시 시도해주세요.
zh_hans: 执行队列已满。请稍后重试。

# success.circuit_executed
source: Circuit executed successfully
de: Schaltung erfolgreich ausgeführt
ja: 回路が正常に実行されました
ko: 회로가 성공적으로 실행되었습니다
zh_hans: 电路执行成功

# success.job_submitted
source: Job submitted to quantum queue
de: Auftrag an Quantenwarteschlange übermittelt
ja: ジョブが量子キューに送信されました
ko: 양자 대기열에 작업이 제출되었습니다
zh_hans: 作业已提交到量子队列

# success.connection_established
source: Connected to quantum backend
de: Verbindung zum Quanten-Backend hergestellt
ja: 量子バックエンドに接続しました
ko: 양자 백엔드에 연결되었습니다
zh_hans: 已连接到量子后端

# success.state_prepared
source: Quantum state prepared successfully
de: Quantenzustand erfolgreich vorbereitet
ja: 量子状態が正常に準備されました
ko: 양자 상태가 성공적으로 준비되었습니다
zh_hans: 量子态准备成功

# bridge.title
source: Bridge
de: QuantumBridge
ja: ブリッジ
zh_hans: 桥接

# bridge.description
source: Connect to real quantum hardware
ja: 実際の量子ハードウェアに接続
zh_hans: 连接真实量子硬件

# bridge.why_use
source: Why Use QuantumBridge?
de: Warum QuantumBridge verwenden?
ja: なぜQuantumBridgeを使うのか？
zh_hans: 为什么使用QuantumBridge？

# bridge.connect_real
source: Connect to Real Quantum Computers
de: Verbinden Sie sich mit echten Quantencomputern
ja: 実際の量子コンピュータに接続
zh_hans: 连接真正的量子计算机

# bridge.deploy.title
source: Deploy Circuit
ja: 回路をデプロイ
zh_hans: 部署电路

# bridge.deploy.hold_text
source: Long press for 2 seconds to deploy
ja: デプロイするには2秒間長押し
zh_hans: 长按2秒部署

# bridge.benefit.hardware.title
source: Real Hardware
de: Echte Hardware
ja: 実物ハードウェア
zh_hans: 真实硬件

# bridge.benefit.hardware.desc
source: Run your circuits on actual IBM quantum processors
de: Schaltungen auf echten IBM Quantenprozessoren ausführen
ja: 実際のIBM量子プロセッサで回路を実行
zh_hans: 在真正的IBM量子处理器上运行电路

# bridge.benefit.quantum.title
source: True Quantum Effects
de: Echte Quanteneffekte
ja: 真の量子効果
zh_hans: 真正的量子效应

# bridge.benefit.quantum.desc
source: Experience real superposition and entanglement
de: Echte Superposition und Verschränkung erleben
ja: 実際の重ね合わせともつれを体験
zh_hans: 体验真正的叠加和纠缠

# bridge.benefit.results.title
source: Authentic Results
de: Authentische Ergebnisse
ja: 本物の結果
zh_hans: 真实结果

# bridge.benefit.results.desc
source: Get measurements from quantum hardware, not simulations
de: Messungen von Quantenhardware, nicht Simulationen
ja: シミュレーションではなく量子ハードウェアから測定値を取得
zh_hans: 从量子硬件获取测量值，而非模拟

# bridge.status.active
source: Bridge Active
de: Bridge Aktiv
ja: ブリッジ有効
zh_hans: Bridge已激活

# bridge.status.disconnected
source: Bridge Disconnected
de: Bridge Getrennt
ja: ブリッジ切断
zh_hans: Bridge已断开

# bridge.connect
source: Connect to QPU
de: Mit QPU verbinden
ja: QPUに接続
zh_hans: 连接到QPU

# bridge.disconnect
source: Disconnect
de: Trennen
ja: 切断
zh_hans: 断开连接

# bridge.select_backend
source: Select Backend
de: Backend auswählen
ja: バックエンドを選択
zh_hans: 选择后端

# bridge.select_backend.desc
source: Choose where to run your quantum circuits
de: Wählen Sie wo Ihre Quantenschaltungen ausgeführt werden
ja: 量子回路を実行する場所を選択
zh_hans: 选择运行量子电路的位置

# bridge.best_for
source: Best for
de: Am besten für
ja: 最適な用途
zh_hans: 最适用于

# bridge.advantages
source: Advantages
de: Vorteile
ja: 利点
zh_hans: 优势

# bridge.limitations
source: Limitations
de: Einschränkungen
ja: 制限事項
zh_hans: 限制

# bridge.backend.simulator.name
source: Simulator
ja: シミュレータ
zh_hans: 模拟器

# bridge.backend.simulator.best
source: Learning & Testing
de: Lernen & Testen
ja: 学習とテスト
zh_hans: 学习与测试

# bridge.backend.simulator.adv1
source: Instant results - no queue wait
de: Sofortige Ergebnisse - keine Wartezeit
ja: 即時結果 - 待ち時間なし
zh_hans: 即时结果 - 无需等待

# bridge.backend.simulator.adv2
source: Free to use - unlimited runs
de: Kostenlos - unbegrenzte Ausführungen
ja: 無料使用 - 無制限実行
zh_hans: 免费使用 - 无限运行

# bridge.backend.simulator.adv3
source: Perfect for debugging circuits
de: Perfekt zum Debuggen von Schaltungen
ja: 回路デバッグに最適
zh_hans: 非常适合调试电路

# bridge.backend.simulator.lim1
source: No real quantum noise
de: Kein echtes Quantenrauschen
ja: 実際の量子ノイズなし
zh_hans: 无真实量子噪声

# bridge.backend.simulator.lim2
source: Limited to classical simulation
de: Auf klassische Simulation beschränkt
ja: 古典シミュレーションに制限
zh_hans: 仅限经典模拟

# bridge.backend.brisbane.best
source: Production & Research
de: Produktion & Forschung
ja: 本番環境と研究
zh_hans: 生产与研究

# bridge.backend.brisbane.adv1
source: 127 real qubits
de: 127 echte Qubits
ja: 127実量子ビット
zh_hans: 127个真实量子比特

# bridge.backend.brisbane.adv2
source: Highest coherence time
de: Höchste Kohärenzzeit
ja: 最高のコヒーレンス時間
zh_hans: 最长相干时间

# bridge.backend.brisbane.adv3
source: Best for complex algorithms
de: Am besten für komplexe Algorithmen
ja: 複雑なアルゴリズムに最適
zh_hans: 最适合复杂算法

# bridge.backend.brisbane.lim1
source: Queue wait time
de: Warteschlangen-Wartezeit
ja: キュー待ち時間
zh_hans: 队列等待时间

# bridge.backend.brisbane.lim2
source: Limited daily usage
de: Tägliches Nutzungslimit
ja: 日次使用制限
zh_hans: 每日使用限制

# bridge.backend.osaka.best
source: High-speed Execution
de: Hochgeschwindigkeitsausführung
ja: 高速実行
zh_hans: 高速执行

# bridge.backend.osaka.adv1
source: 127 real qubits
de: 127 echte Qubits
ja: 127実量子ビット
zh_hans: 127个真实量子比特

# bridge.backend.osaka.adv2
source: Optimized gate speed
de: Optimierte Gattergeschwindigkeit
ja: 最適化されたゲート速度
zh_hans: 优化的门速度

# bridge.backend.osaka.adv3
source: Shorter queue times
de: Kürzere Warteschlangen
ja: 短い待ち行列
zh_hans: 较短的队列

# bridge.backend.osaka.lim1
source: Moderate noise levels
de: Mittlerer Rauschpegel
ja: 中程度のノイズレベル
zh_hans: 中等噪声水平

# bridge.backend.osaka.lim2
source: Limited daily usage
de: Tägliches Nutzungslimit
ja: 日次使用制限
zh_hans: 每日使用限制

# bridge.backend.kyoto.best
source: Research Projects
de: Forschungsprojekte
ja: 研究プロジェクト
zh_hans: 研究项目

# bridge.backend.kyoto.adv1
source: 127 real qubits
de: 127 echte Qubits
ja: 127実量子ビット
zh_hans: 127个真实量子比特

# bridge.backend.kyoto.adv2
source: Advanced error mitigation
de: Erweiterte Fehlerminderung
ja: 高度なエラー軽減
zh_hans: 高级错误缓解

# bridge.backend.kyoto.adv3
source: Research partnerships
de: Forschungspartnerschaften
ja: 研究パートナーシップ
zh_hans: 研究合作伙伴

# bridge.backend.kyoto.lim1
source: Currently in maintenance
de: Derzeit in Wartung
ja: 現在メンテナンス中
zh_hans: 目前维护中

# bridge.backend.kyoto.lim2
source: Limited availability
de: Eingeschränkte Verfügbarkeit
ja: 限定的な可用性
zh_hans: 可用性有限

# bridge.queue.title
source: Queue Status
de: Warteschlangenstatus
ja: キュー状態
zh_hans: 队列状态

# bridge.queue.pending
source: Pending
de: Ausstehend
ja: 保留中
zh_hans: 待处理

# bridge.queue.running
source: Running
de: Läuft
ja: 実行中
zh_hans: 运行中

# bridge.queue.wait
source: Est. Wait
de: Gesch. Wartezeit
ja: 予想待機
zh_hans: 预计等待

# bridge.deploy.hold
source: Hold to Deploy
de: Halten zum Bereitstellen
ja: 長押しでデプロイ
zh_hans: 长按部署

# bridge.deploy.deploying
source: Deploying...
de: Wird bereitgestellt...
ja: デプロイ中...
zh_hans: 部署中...

# bridge.deploy.to
source: to
de: an
ja: へ
zh_hans: 到

# bridge.actions.title
source: Quick Actions
de: Schnellaktionen
ja: クイックアクション
zh_hans: 快速操作

# bridge.actions.subtitle
source: Run pre-built quantum experiments
ja: 事前構築された量子実験を実行
zh_hans: 运行预构建的量子实验

# bridge.actions.bell
source: Bell State
de: Bell-Zustand
ja: ベル状態
zh_hans: 贝尔态

# bridge.actions.bell.desc
source: Create entanglement
de: Verschränkung erstellen
ja: もつれを作成
zh_hans: 创建纠缠

# bridge.actions.ghz
source: GHZ State
de: GHZ-Zustand
ja: GHZ状態
zh_hans: GHZ态

# bridge.actions.ghz.desc
source: Multi-qubit entanglement
de: Multi-Qubit Verschränkung
ja: 多量子ビットもつれ
zh_hans: 多量子比特纠缠

# bridge.actions.export
source: Export QASM
de: QASM exportieren
ja: QASMエクスポート
zh_hans: 导出QASM

# bridge.actions.export.desc
source: Get OpenQASM 3.0 code
de: OpenQASM 3.0 Code erhalten
ja: OpenQASM 3.0コードを取得
zh_hans: 获取OpenQASM 3.0代码

# bridge.actions.continuous
source: Continuous Mode
de: Kontinuierlicher Modus
ja: 連続モード
zh_hans: 连续模式

# bridge.actions.continuous.desc
source: Auto-repeat every 30s
de: Automatisch alle 30s wiederholen
ja: 30秒ごとに自動繰り返し
zh_hans: 每30秒自动重复

# bridge.actions.continuous.active
source: Active
de: Aktiv
ja: 有効
zh_hans: 已激活

# bridge.actions.continuous.runs
source: runs
de: Ausführungen
ja: 回実行
zh_hans: 次运行

# bridge.actions.continuous.stop
source: Stop Continuous
de: Kontinuierlichen Modus stoppen
ja: 連続モード停止
zh_hans: 停止连续模式

# bridge.jobs.title
source: Active Jobs
de: Aktive Jobs
ja: アクティブジョブ
zh_hans: 活动作业

# bridge.jobs.position
source: Position
ja: 位置
zh_hans: 位置

# bridge.jobs.shots
source: shots
ja: ショット
zh_hans: 次测量

# bridge.jobs.running
source: Running
de: Läuft
ja: 実行中
zh_hans: 运行中

# bridge.jobs.queued
source: Queued
de: In Warteschlange
ja: キュー中
zh_hans: 排队中

# bridge.qasm.title
source: Export QASM Code
de: QASM-Code exportieren
ja: QASMコードエクスポート
zh_hans: 导出QASM代码

# bridge.qasm.copy
source: Copy to Clipboard
de: In Zwischenablage kopieren
ja: クリップボードにコピー
zh_hans: 复制到剪贴板

# bridge.qasm.copied
source: Copied!
de: Kopiert!
ja: コピー完了！
zh_hans: 已复制！

# bridge.qasm.share
source: Share
de: Teilen
ja: 共有
zh_hans: 分享

# bridge.error.title
source: Error Correction
de: Fehlerkorrektur
ja: エラー訂正
zh_hans: 错误纠正

# bridge.error.surface
source: Surface Code
de: Oberflächencode
ja: 表面コード
zh_hans: 表面码

# bridge.error.active
source: Active
de: Aktiv
ja: 有効
zh_hans: 已激活

# ecosystem.title
source: IBM Quantum Ecosystem
zh_hans: IBM Quantum生态系统

# ecosystem.subtitle
source: Run real quantum projects from the ecosystem
de: Echte Quantenprojekte aus dem Ökosystem ausführen
ja: エコシステムから実際の量子プロジェクトを実行
zh_hans: 运行生态系统中的真实量子项目

# ecosystem.all
source: All
de: Alle
ja: すべて
zh_hans: 全部

# ecosystem.category.ml
source: Machine Learning
de: Maschinelles Lernen
ja: 機械学習
zh_hans: 机器学习

# ecosystem.category.chemistry
source: Chemistry & Physics
de: Chemie & Physik
ja: 化学・物理学
zh_hans: 化学与物理

# ecosystem.category.optimization
source: Optimization
de: Optimierung
ja: 最適化
zh_hans: 优化

# ecosystem.category.hardware
source: Hardware Providers
de: Hardware-Anbieter
ja: ハードウェアプロバイダ
zh_hans: 硬件提供商

# ecosystem.category.simulation
source: Simulation
ja: シミュレーション
zh_hans: 模拟

# ecosystem.category.research
source: Research
de: Forschung
ja: 研究
zh_hans: 研究

# ecosystem.about
source: About
de: Über
ja: 概要
zh_hans: 关于

# ecosystem.actions
source: Quick Actions
de: Schnellaktionen
ja: クイックアクション
zh_hans: 快速操作

# ecosystem.run_demo
source: Run Demo Circuit
de: Demo-Schaltung ausführen
ja: デモ回路を実行
zh_hans: 运行演示电路

# ecosystem.running
source: Running...
de: Läuft...
ja: 実行中...
zh_hans: 运行中...

# ecosystem.export_code
source: Export Sample Code
de: Beispielcode exportieren
ja: サンプルコードをエクスポート
zh_hans: 导出示例代码

# ecosystem.view_github
source: View on GitHub
de: Auf GitHub anzeigen
ja: GitHubで表示
zh_hans: 在GitHub查看

# ecosystem.result
source: Execution Result
de: Ausführungsergebnis
ja: 実行結果
zh_hans: 执行结果

# ecosystem.use_cases
source: Use Cases
de: Anwendungsfälle
ja: ユースケース
zh_hans: 使用场景

# ecosystem.sample_code
source: Sample Code
de: Beispielcode
ja: サンプルコード
zh_hans: 示例代码

# ecosystem.copy
source: Copy to Clipboard
de: In Zwischenablage kopieren
ja: クリップボードにコピー
zh_hans: 复制到剪贴板

# circuits.title
source: Circuit Builder
de: Schaltungs-Builder
ja: 回路ビルダー
zh_hans: 电路构建器

# circuits.subtitle
source: Build and run quantum circuits
de: Quantenschaltungen erstellen und ausführen
ja: 量子回路を構築して実行
zh_hans: 构建和运行量子电路

# circuits.stat.templates
source: Templates
de: Vorlagen
ja: テンプレート
zh_hans: 模板

# circuits.stat.runs
source: Runs
de: Ausführungen
ja: 実行回数
zh_hans: 运行次数

# circuits.stat.favorites
source: Favorites
de: Favoriten
ja: お気に入り
zh_hans: 收藏

# circuits.quick.title
source: Quick Start
de: Schnellstart
ja: クイックスタート
zh_hans: 快速开始

# circuits.featured.title
source: Featured Circuits
de: Empfohlene Schaltungen
ja: おすすめ回路
zh_hans: 推荐电路

# circuits.templates.title
source: All Templates
de: Alle Vorlagen
ja: 全テンプレート
zh_hans: 所有模板

# circuits.recent.title
source: Recent Runs
de: Kürzlich ausgeführt
ja: 最近の実行
zh_hans: 最近运行

# circuits.recent.clear
source: Clear
de: Löschen
ja: クリア
zh_hans: 清除

# circuits.category.basic
source: Basic Gates
de: Grundlegende Gatter
ja: 基本ゲート
zh_hans: 基础门

# circuits.category.entanglement
source: Entanglement
de: Verschränkung
ja: もつれ
zh_hans: 纠缠

# circuits.category.algorithms
source: Algorithms
de: Algorithmen
ja: アルゴリズム
zh_hans: 算法

# circuits.category.error
source: Error Correction
de: Fehlerkorrektur
ja: エラー訂正
zh_hans: 纠错

# circuits.bell.desc
source: Create entanglement between 2 qubits
de: Verschränkung zwischen 2 Qubits erstellen
ja: 2量子ビットのもつれを作成
zh_hans: 创建2量子比特纠缠

# circuits.ghz.desc
source: 3-qubit maximally entangled state
de: 3-Qubit maximal verschränkter Zustand
ja: 3量子ビット最大もつれ状態
zh_hans: 3量子比特最大纠缠态

# circuits.grover.desc
source: Quantum search with quadratic speedup
de: Quantensuche mit quadratischer Beschleunigung
ja: 2次速度向上の量子検索
zh_hans: 二次加速量子搜索

# circuits.teleport.desc
source: Transfer quantum state using entanglement
de: Quantenzustand mittels Verschränkung übertragen
ja: もつれを使用した量子状態転送
zh_hans: 使用纠缠传输量子态

# circuits.dj.desc
source: Determine if function is constant or balanced
de: Bestimmen ob Funktion konstant oder ausgeglichen ist
ja: 関数が定数か均衡かを判定
zh_hans: 判断函数是常数还是平衡

# circuits.surface.desc
source: Topological error correction code
de: Topologischer Fehlerkorrekturcode
ja: トポロジカルエラー訂正コード
zh_hans: 拓扑纠错码

# circuits.qaoa.desc
source: Quantum approximate optimization
de: Quantenapproximierte Optimierung
ja: 量子近似最適化
zh_hans: 量子近似优化

# circuits.hadamard.desc
source: Create equal superposition
de: Gleichmäßige Superposition erstellen
ja: 均等な重ね合わせを作成
zh_hans: 创建均等叠加

# circuits.xgate.desc
source: Quantum bit flip operation
de: Quanten-Bit-Flip-Operation
ja: 量子ビット反転演算
zh_hans: 量子比特翻转操作

# circuits.phase.desc
source: Apply S and T phase rotations
de: S- und T-Phasenrotationen anwenden
ja: SとT位相回転を適用
zh_hans: 应用S和T相位旋转

# circuits.bitflip.desc
source: Correct single bit-flip errors
de: Einzelne Bit-Flip-Fehler korrigieren
ja: 単一ビット反転エラーを訂正
zh_hans: 纠正单比特翻转错误

# circuits.phaseflip.desc
source: Correct single phase-flip errors
de: Einzelne Phasen-Flip-Fehler korrigieren
ja: 単一位相反転エラーを訂正
zh_hans: 纠正单相位翻转错误

# circuits.detail.about
source: About
de: Über
ja: 概要
zh_hans: 关于

# circuits.detail.gates
source: Gates Used
de: Verwendete Gatter
ja: 使用ゲート
zh_hans: 使用的门

# circuits.detail.run
source: Run Circuit
de: Schaltung ausführen
ja: 回路を実行
zh_hans: 运行电路

# circuits.run
source: Run Circuit
de: Schaltung ausführen
ja: 回路を実行
zh_hans: 运行电路

# circuits.running
source: Running...
de: Läuft...
ja: 実行中...
zh_hans: 运行中...

# circuits.result
source: Result
de: Ergebnis
ja: 結果
zh_hans: 结果

# swiftquantum.copyright
source: © 2026 iOS Quantum Engineering. All rights reserved.
de: © 2026 iOS Quantum Engineering. Alle Rechte vorbehalten.
